import random
from tkinter import ttk
from tkinter import *

root = Tk()
root.title("Игра Hangman, категория: ""Животные")
root.geometry("500x500+700+300")

animals_word_list = ["кот", "собака", "осел", "козел", "лошадь", "свинья", "кролик", "трубкозуб", "альбатрос",
    "аллигатор", "альпака", "амфибия", "анаконда", "удильщик", "муравей", "муравьед", "антилопа",
    "лев", "тигр", "медведь", "волк", "лиса", "заяц", "олень", "кабан", "белка", "бегемот", "слон",
    "жираф", "обезьяна", "кенгуру", "енот", "барсук", "дельфин", "кит", "корова", "ёж", "орёл", "сова",
    "воробей", "голубь", "ворона", "фламинго", "пеликан", "пингвин", "аист", "соловей", "кукушка", "попугай",
    "лебедь", "утка", "журавль", "крокодил", "ящерица", "черепаха", "игуана", "хамелеон", "лягушка", "жаба",
    "саламандра", "тритон", "акула", "скат", "карп", "форель", "тунец", "золотая рыбка", "морской конёк", "сельдь",
    "сом", "муравей", "пчела", "бабочка", "комар", "жук", "кузнечик", "таракана", "стрекоза", "божья коровка", "мотылёк",
    "паук", "скорпион", "клещ", "осьминог", "кальмар", "улитка", "мидия", "устрица", "медуза", "морская звезда", "краб", "лангуст", "морской ёж"]

word = random.choice(animals_word_list)
word_letters = list(word)
guessed_letters = set()
tries = 7






root.mainloop()